{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE ImportQualifiedPost #-}
module Lib.Rhymes where

import Data.Map (Map)
import Data.Map qualified as Map
import Data.Text (Text)

list_平水 :: Map Text (Text, Text, Text)
list_平水 = Map.fromList . concatMap (\(t, ics) -> map (\(i, c) -> (t <> "聲" <> i <> c, (t, i, c))) ics) $ lists
  where
    lists = [ ("上平", list_平水_上平)
            , ("下平", list_平水_下平)
            , ("上", list_平水_上)
            , ("去", list_平水_去)
            , ("入", list_平水_入)
            ]

list_平水_上平 :: [(Text, Text)]
list_平水_上平 =
  [ ("一", "東")
  , ("二", "冬")
  , ("三", "江")
  , ("四", "支")
  , ("五", "微")
  , ("六", "魚")
  , ("七", "虞")
  , ("八", "齊")
  , ("九", "佳")
  , ("十", "灰")
  , ("十一", "真")
  , ("十二", "文")
  , ("十三", "元")
  , ("十四", "寒")
  , ("十五", "刪")
  ]

list_平水_下平 :: [(Text, Text)]
list_平水_下平 =
  [ ("一", "先")
  , ("二", "蕭")
  , ("三", "肴")
  , ("四", "豪")
  , ("五", "歌")
  , ("六", "麻")
  , ("七", "陽")
  , ("八", "庚")
  , ("九", "青")
  , ("十", "蒸")
  , ("十一", "尤")
  , ("十二", "侵")
  , ("十三", "覃")
  , ("十四", "鹽")
  , ("十五", "咸")
  ]

list_平水_上 :: [(Text, Text)]
list_平水_上 =
  [("一", "董")
  , ("二", "腫")
  , ("三", "講")
  , ("四", "紙")
  , ("五", "尾")
  , ("六", "語")
  , ("七", "麌")
  , ("八", "薺")
  , ("九", "蟹")
  , ("十", "賄")
  , ("十一", "軫")
  , ("十二", "吻")
  , ("十三", "阮")
  , ("十四", "旱")
  , ("十五", "潸")
  , ("十六", "銑")
  , ("十七", "篠")
  , ("十八", "巧")
  , ("十九", "皓")
  , ("二十", "哿")
  , ("二十一", "馬")
  , ("二十二", "養")
  , ("二十三", "梗")
  , ("二十四", "迥")
  , ("二十五", "有")
  , ("二十六", "寢")
  , ("二十七", "感")
  , ("二十八", "琰")
  , ("二十九", "豏")
  ]

list_平水_去 :: [(Text, Text)]
list_平水_去 =
  [ ("一", "送")
  , ("二", "宋")
  , ("三", "絳")
  , ("四", "寘")
  , ("五", "未")
  , ("六", "御")
  , ("七", "遇")
  , ("八", "霽")
  , ("九", "泰")
  , ("十", "卦")
  , ("十一", "隊")
  , ("十二", "震")
  , ("十三", "問")
  , ("十四", "願")
  , ("十五", "翰")
  , ("十六", "諫")
  , ("十七", "霰")
  , ("十八", "嘯")
  , ("十九", "效")
  , ("二十", "號")
  , ("二十一", "箇")
  , ("二十二", "禡")
  , ("二十三", "漾")
  , ("二十四", "敬")
  , ("二十五", "徑")
  , ("二十六", "宥")
  , ("二十七", "沁")
  , ("二十八", "勘")
  , ("二十九", "艶")
  , ("三十", "陷")
  ]

list_平水_入 :: [(Text, Text)]
list_平水_入 =
  [ ("一", "屋")
  , ("二", "沃")
  , ("三", "覺")
  , ("四", "質")
  , ("五", "物")
  , ("六", "月")
  , ("七", "曷")
  , ("八", "黠")
  , ("九", "屑")
  , ("十", "藥")
  , ("十一", "陌")
  , ("十二", "錫")
  , ("十三", "職")
  , ("十四", "緝")
  , ("十五", "合")
  , ("十六", "葉")
  , ("十七", "洽")
  ]
